mfawazsec/m5-ctOS-cardputer/firmware/sdkconfig.defaults
# Target: ESP32-S3
CONFIG_IDF_TARGET="esp32s3"

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM — hardware has no working PSRAM; disabling avoids boot errors and
# unblocks WiFi dynamic TX buffers (ESP_WIFI_DYNAMIC_TX_BUFFER depends on
# !SPIRAM_USE_MALLOC, and ESP_WIFI_CACHE_TX_BUFFER_NUM depends on SPIRAM).
# Module code already falls back to regular heap when SPIRAM alloc returns NULL.
# CONFIG_SPIRAM is not set

# WiFi — dynamic TX buffers (valid when SPIRAM is disabled).
# Static RX buffers reduced from default 10 → 6 to recover ~9 KB of heap
# (6 × 2212 bytes = 13 KB vs 22 KB); 6 is sufficient for a low-traffic AP.
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y
CONFIG_ESP_WIFI_ENABLE_WPA3_SAE=y
CONFIG_ESP_WIFI_CSI_ENABLED=y
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER=y
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=16
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=6

# USB (HID device for BadUSB module)
CONFIG_USB_OTG_SUPPORTED=y

# BLE (NimBLE for BLERP and BLE HID)
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_HID_SERVICE=y
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=8192

# HTTP server
CONFIG_HTTPD_MAX_REQ_HDR_LEN=512
CONFIG_HTTPD_MAX_URI_LEN=512

# FAT LFN (needed for manifest.json filenames > 8.3)
# Use stack allocation so SD FAT mount succeeds after M5.begin() consumes heap
CONFIG_FATFS_LFN_STACK=y

# NVS
CONFIG_NVS_ENCRYPTION=n

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_ENABLE_BACKWARD_COMPATIBILITY=n

# Stack sizes
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# I2S (audio modules)
CONFIG_SOC_I2S_NUM=2

# Arduino compatibility off (pure IDF)
CONFIG_AUTOSTART_ARDUINO=n
